applications/test/coupledFvPatch/testFullMatching/AMI/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    left1
    {
        type            uniformFixedValue;
        uniformValue    constant (0.1 0 0);
        value           uniform (0.1 0 0);
    }
    walls1
    {
        type            noSlip;
    }
    right2
    {
        type            zeroGradient;
    }
    walls2
    {
        type            noSlip;
    }
}


// ************************************************************************* //
